openfoam-shockTube/simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    side1
    {
        type            patch;
        nFaces          1;
        startFace       199;
    }
    side2
    {
        type            patch;
        nFaces          1;
        startFace       200;
    }
    empty
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          800;
        startFace       201;
    }
)

// ************************************************************************* //
